Repository: newbe36524/Newbe.Claptrap
Catalog: src/Newbe.Claptrap.Localization/LK.*.resx
Languages: de_de, fr_fr, ru_ru, zh_cn

source: failed to build claptrap bootstrapper
de_de: Claptrap-Bootstrapper konnte nicht erstellt werden
fr_fr: n’a pas réussi à construire claptrap bootstrapper
ru_ru: не удалось построить claptrap загрузчик
zh_cn: 无法构建 claptrap 启动器

source: failed to activate claptrap {identity}
de_de: Claptrap konnte nicht aktiviert werden {identity}
fr_fr: n’a pas réussi à activer claptrap {identity}
ru_ru: не удалось активировать claptrap {identity}
zh_cn: 未能激活 Claptrap {identity}

source: success to notify about event be handled. event version : {version}
de_de: Erfolg, um über Ereignis zu benachrichtigen, behandelt werden. Ereignisversion : {version}
fr_fr: succès pour informer de l’événement être traitée. version événement : {version}
ru_ru: успех, чтобы уведомить о событии быть обработаны. версия события : {version}
zh_cn: 事件通知成功。事件版本 ： {version}

source: failed to notify about event be handled. event version : {version}
de_de: nicht über das Ereignis benachrichtigt werden konnte. Ereignisversion : {version}
fr_fr: n’a pas été avisé de l’événement. version événement : {version}
ru_ru: не уведомить о событии быть обработаны. версия события : {version}
zh_cn: 事件通知失败。事件版本 ： {version}

source: there is no state snapshot found from state loader
de_de: Es wurde kein Statussnapshot vom Zustandsladeprogramm gefunden
fr_fr: il n’y a pas d’instantané d’état trouvé à partir du chargeur d’état
ru_ru: нет никакого снимка состояния, найденного из государственного погрузчика
zh_cn: 未能从 state loader 中找到 state 的快照

source: found state snapshot from state loader
de_de: Status-Snapshot vom Zustandsladeprogramm gefunden
fr_fr: instantané d’état trouvé à partir du chargeur d’état
ru_ru: найден снимок состояния из государственного погрузчика
zh_cn: 从 state loader 中找到了 state 快照

source: MissingEventHandler
de_de: Es wurde kein Ereignishandler für {eventTypeCode} In {claptrapTypeCode}. Es muss definiert werden, da dies ein Diener ist, und der Mater wird es dazu schicken. Wenn Sie das Ereignis nicht verarbeiten, können Sie {handlerName} für dieses Ereignis.
fr_fr: Aucun gestionnaire d’événements n’a été trouvé pour {eventTypeCode} Dans {claptrapTypeCode}. Il doit être défini comme il s’agit d’un sbire et le mater va l’envoyer à cela. Si vous ne gérez pas l’événement, vous pouvez définir {handlerName} pour cet événement.
ru_ru: Для обработчика событий не найдено {eventTypeCode} В {claptrapTypeCode}. Он должен быть определен, как это миньон и матер будет отправить его к этому. Если вы не справитесь с событием, вы можете определить {handlerName} для этого события.
zh_cn: 在 {claptrapTypeCode} claptrap 中未能找到 {eventTypeCode} 对应的 event handler。 它必须被定义，因为这是一个 minion，主 claptrap 将会把事件发送到此处。如果不想处理该事件，可以定义 {handlerName} 用于处理该事件。

source: {name} is required, please set it correctly.
de_de: {name} erforderlich ist, stellen Sie es bitte richtig ein.
fr_fr: {name} est nécessaire, s’il vous plaît le définir correctement.
ru_ru: {name} требуется, пожалуйста, установите его правильно.
zh_cn: {name} 是必须的，请正确的设置。

source: Type {type} does not implement {componentType}.
de_de: Typ {type} implementiert nicht {componentType}.
fr_fr: Type {type} ne met pas en œuvre {componentType}.
ru_ru: Тип {type} не реализует {componentType}.
zh_cn: 类型 {type} 未实现 {componentType}.

source: failed to create a claptrap. {identity}
de_de: fehlerbesagte Erstellung einer Klatsche. {identity}
fr_fr: n’a pas réussi à créer un claptrap. {identity}
ru_ru: не удалось создать claptrap. {identity}
zh_cn: 未能创建 Claptrap。 {identity}

source: IsMinion
de_de: Dies ist eine Minion-Klatsche, da sie ein Master-Design im Design enthält. Mastertypcode : {typeCode}
fr_fr: Il s’agit d’un claptrap sbire car il contient un design maître dans sa conception. code de type maître : {typeCode}
ru_ru: Это миньон claptrap, поскольку он содержит мастер-дизайн в его дизайне. код типа master : {typeCode}
zh_cn: 这是一个 Minion，因为它包含一个 master design。master design type code ： {typeCode}

source: This is a master claptrap. type code : {typeCode}
de_de: Dies ist eine Master-Klatsche. Typcode : {typeCode}
fr_fr: C’est un claptrap de maître. code de type : {typeCode}
ru_ru: Это мастер claptrap. тип кода : {typeCode}
zh_cn: 这是一个 master claptrap。type code ： {typeCode}

source: add {provider} as claptrap design provider
de_de: Hinzufügen {provider} als Claptrap-Designanbieter
fr_fr: Ajouter {provider} en tant que fournisseur de conception claptrap
ru_ru: Добавить {provider} как поставщик дизайна claptrap
zh_cn: 添加 {provider} 作为 claptrap design provider

source: start to scan {assemblyArrayCount} types
de_de: Starten Sie den Scan {assemblyArrayCount} Typen
fr_fr: commencer à numériser {assemblyArrayCount} Types
ru_ru: начать сканирование {assemblyArrayCount} Типы
zh_cn: 开始扫描 {assemblyArrayCount} 类型

source: start to create claptrap design
de_de: Beginnen Sie mit der Erstellung des Claptrap-Designs
fr_fr: commencer à créer la conception claptrap
ru_ru: начать создавать дизайн claptrap
zh_cn: 开始创建 claptrap design

source: claptrap design store created, start to configure it
de_de: claptrap Design Store erstellt, beginnen Sie, es zu konfigurieren
fr_fr: claptrap design store créé, commencer à le configurer
ru_ru: claptrap дизайн магазин создан, начать его настройки
zh_cn: claptrap design store 创建完成， 开始调整设置。

source: all designs : {designs}
de_de: alle Designs : {designs}
fr_fr: tous les modèles : {designs}
ru_ru: все проекты : {designs}
zh_cn: 所有的 design 如下： {designs}

source: start to configure claptrap design store by {configurator}
de_de: starten Sie die Konfiguration des Claptrap-Designspeichers durch {configurator}
fr_fr: commencer à configurer le magasin de conception claptrap par {configurator}
ru_ru: начать настраивать магазин дизайна claptrap по {configurator}
zh_cn: 通过 {configurator} 配置 claptrap design store

source: found {actorCount} claptrap designs
de_de: Gefunden {actorCount} Claptrap Designs
fr_fr: Trouvé {actorCount} conceptions claptrap
ru_ru: Нашел {actorCount} хлоптрап конструкций
zh_cn: 发现了 {actorCount} 个 claptrap design

source: all designs after configuration: {designs}
de_de: alle Designs nach der Konfiguration: {designs}
fr_fr: toutes les conceptions après configuration : {designs}
ru_ru: все проекты после конфигурации: {designs}
zh_cn: 完成配置后的所有 design 如下： {designs}

source: start to validate all design in claptrap design store
de_de: Starten Sie, um alle Designs im Claptrap-Designspeicher zu validieren
fr_fr: commencer à valider tous les design dans le magasin de conception claptrap
ru_ru: начать проверять все дизайн в магазине дизайна claptrap
zh_cn: 开始验证 claptrap design store 中的所有 design

source: all design validated ok
de_de: alle Design validiert ok
fr_fr: tous les design validés ok
ru_ru: все дизайн проверены нормально
zh_cn: 所有 design 验证完毕，没有问题

source: There is a IStringLocalizer found in container, start to use localization in UI culture
de_de: Es gibt einen IStringLocalizer in Container gefunden, beginnen, Lokalisierung in UI-Kultur zu verwenden
fr_fr: Il ya un IStringLocalizer trouvé dans le conteneur, commencer à utiliser la localisation dans la culture de l’interface utilisateur
ru_ru: В контейнере обнаружен IStringLocalizer, начинается локализация в культуре пользовательского интерфейса
zh_cn: 容器中存在 IStringLocalizer，将根据 UI 区域性进行本地化

source: There is no IStringLocalizer found in container, start to use default localization in English
de_de: Es gibt keinen IStringLocalizer in Container gefunden, beginnen Sie, Standard-Lokalisierung in Englisch zu verwenden
fr_fr: Il n’y a pas d’IStringLocalizer trouvé dans le conteneur, commencer à utiliser la localisation par défaut en anglais
ru_ru: В контейнере нет IStringLocalizer, начинают использовать локализацию по умолчанию на английском языке
zh_cn: 容器中找不到 IStringLocalizer，将使用英文作为默认语言

source: Template
de_de: Vorlage
fr_fr: Modèle
ru_ru: Шаблон
zh_cn: 模板
