Repository: newbe36524/Newbe.Claptrap
Catalog: */src/Newbe.Claptrap.Localization/LK.*.resx
Languages: it_it, zh_cn, zh_tw

source: failed to build claptrap bootstrapper
it_it: non è riuscito a costruire il programma di avvio automatico claptrap
zh_cn: 未能构建拍手引导器
zh_tw: 未能構建拍手引導器。

source: failed to activate claptrap {identity}
it_it: non è riuscito ad attivare claptrap {identity}
zh_cn: 未能激活拍手 {identity}
zh_tw: 未能啟動拍手。 {identity}

source: success to notify about event be handled. event version : {version}
it_it: notificare l'evento. versione evento : {version}
zh_cn: 成功通知事件被处理。事件版本 ： {version}
zh_tw: 成功通知事件被處理。事件版本 : {version}

source: failed to notify about event be handled. event version : {version}
it_it: non è stato possibile notificare l'evento. versione evento : {version}
zh_cn: 未能通知有关事件的处理。事件版本 ： {version}
zh_tw: 未能通知有關事件的處理。事件版本 : {version}

source: there is no state snapshot found from state loader
it_it: non viene trovata alcuna istantanea di stato dal caricatore di stato
zh_cn: 未从状态加载程序找到状态快照
zh_tw: 未從狀態載入程式找到狀態快照。

source: found state snapshot from state loader
it_it: stato trovato snapshot dal caricatore di stato
zh_cn: 从状态加载器找到状态快照
zh_tw: 從狀態載入器找到狀態快照。

source: MissingEventHandler
it_it: Non viene trovato alcun gestore eventi per {eventTypeCode} Pollici {claptrapTypeCode}. Deve essere definito come questo è un servitore e il mater lo invierà a questo. Se non gestisci l'evento, puoi definire {handlerName} per questo evento.
zh_cn: 没有找到事件处理程序 {eventTypeCode} 在 {claptrapTypeCode}.它必须被定义，因为这是一个小人，母校将发送它到这个。如果不处理该事件，可以定义 {handlerName} 对于此事件。
zh_tw: 沒有找到事件處理程式。 {eventTypeCode} 在。 {claptrapTypeCode}.它必須被定義,因為這是一個小人,母校將發送它到這個。如果不處理該事件,可以定義。 {handlerName} 對於此事件。

source: {name} is required, please set it correctly.
it_it: {name} è necessario, si prega di impostarlo correttamente.
zh_cn: {name} 需要，请正确设置。
zh_tw: {name} 需要,請正確設置。

source: Type {type} does not implement {componentType}.
it_it: digitare {type} non implementa {componentType}.
zh_cn: 类型 {type} 不实现 {componentType}.
zh_tw: 類型。 {type} 不實現。 {componentType}.

source: failed to create a claptrap. {identity}
it_it: non è riuscito a creare un claptrap. {identity}
zh_cn: 未能创建拍手。 {identity}
zh_tw: 未能創建拍手。 {identity}

source: IsMinion
it_it: Questo è un applauso servitore in quanto contiene un design master nel suo design. codice del tipo di master : {typeCode}
zh_cn: 这是一个小拍手，因为它包含一个主设计，它的设计。主类型代码 ： {typeCode}
zh_tw: 這是一個小拍手,因為它包含一個主設計,它的設計。主型態碼 : {typeCode}

source: This is a master claptrap. type code : {typeCode}
it_it: Questo è un maestro claptrap. codice tipo : {typeCode}
zh_cn: 这是一个主拍手。类型代码 ： {typeCode}
zh_tw: 這是一個主拍手。型態碼 : {typeCode}

source: add {provider} as claptrap design provider
it_it: Aggiungere {provider} come fornitore di design claptrap
zh_cn: 添加 {provider} 作为拍手设计提供商
zh_tw: 添加。 {provider} 作為拍手設計供應商。

source: start to scan {assemblyArrayCount} types
it_it: iniziare a eseguire la scansione {assemblyArrayCount} Tipi
zh_cn: 开始扫描 {assemblyArrayCount} 类型
zh_tw: 開始掃描。 {assemblyArrayCount} 類型。

source: start to create claptrap design
it_it: iniziare a creare il design claptrap
zh_cn: 开始创建拍手设计
zh_tw: 開始創建拍手設計。

source: claptrap design store created, start to configure it
it_it: claptrap design store creato, iniziare a configurarlo
zh_cn: 拍手设计存储创建， 开始配置它
zh_tw: 拍手設計儲存建立, 開始配置它。

source: all designs : {designs}
it_it: tutti i disegni : {designs}
zh_cn: 所有设计： {designs}
zh_tw: 所有設計: {designs}

source: start to configure claptrap design store by {configurator}
it_it: iniziare a configurare il negozio di design claptrap da {configurator}
zh_cn: 开始配置拍手设计存储 {configurator}
zh_tw: 開始配置拍手設計存儲。 {configurator}

source: found {actorCount} claptrap designs
it_it: Trovato {actorCount} claptrap disegni
zh_cn: 发现 {actorCount} 拍手设计
zh_tw: 發現。 {actorCount} 拍手設計。

source: all designs after configuration: {designs}
it_it: tutti i disegni dopo la configurazione: {designs}
zh_cn: 配置后的所有设计： {designs}
zh_tw: 設定後的所有設計: {designs}

source: start to validate all design in claptrap design store
it_it: iniziare a convalidare tutto il design in claptrap negozio di design
zh_cn: 开始验证拍手设计商店中的所有设计
zh_tw: 開始驗證拍手設計商店中的所有設計。

source: all design validated ok
it_it: tutto il design convalidato ok
zh_cn: 所有设计验证确定
zh_tw: 所有設計驗證確定。

source: There is a IStringLocalizer found in container, start to use localization in UI culture
it_it: C'è un IStringLocalizer trovato nel contenitore, iniziare a utilizzare la localizzazione nelle impostazioni cultura dell'interfaccia utenteThere is a IStringLocalizer found in container, start to use localization in UI culture
zh_cn: 容器中存在一个 IString 定位器，在 UI 区域性中开始使用本地化
zh_tw: 容器中存在一個 IString 定位器,在 UI 區域性中開始使用當地語系化。

source: There is no IStringLocalizer found in container, start to use default localization in English
it_it: Non c'è nessun IStringLocalizer trovato nel contenitore, iniziare a utilizzare la localizzazione predefinita in inglese
zh_cn: 容器中找不到 IString 定位器，开始使用英语默认本地化
zh_tw: 容器中找不到 IString 定位器,開始使用英語預設當地語系化。

source: Template
it_it: Modello
zh_cn: 模板
zh_tw: 範本。
